amber
ashen
auburn
azure
blanched
bleached
blotchy
brindled
bronzed
burnished
buttery
chalky
cindered
citrine
clouded
coal-like
cobalt
coppery
creamy
dusky
ebony
ember-like
emerald
frosted
gilded
glaucous
glistening
goldenrod
hazel
hazy
indigo
ivory
jade
jet-black
khaki
lavender
leaden
lilac
linen-colored
mahogany
mauve
misty
mottled-gray
ochre
olive-toned
opaline
pallid
pearl-like
pewter
plum
prismatic
roseate
rosy
russet
rusted
saffron
sandy
sanguine
sepia
silvery
sienna
slate-colored
smoky
snowy
steel-blue
sunlit
teal
umber
verdant
vermilion
violet-hued
wine-colored
ashen-gray
bone-white
carmine
cerulean
chartreuse
chrome-like
cinnamon
clay-toned
cloudy-gray
copper-toned
coral-tinted
cream-colored
crimson
dandelion
dove-gray
earthen
eggplant-colored
evergreen
faded-gray
ferric
fiery
flaxen
fluorescent
foggy
garnet
ghostly
glowing-red
granite
graphitic
grayish-blue
harlequin
heliotrope
honeyed
icy
incandescent
inky
iron-like
jasmine-toned
jet
jungle-green
lattice-like
lead-gray
lemony
lilied
limestone-colored
livid
luminous
magenta
malachite
marigold
metallic
midnight
milky
mist-grey
molten
moonlit
mosaic-like
navy
nimbus-gray
obsidian
ochrous
onyx
opal
orange-tinted
pale-gray
pale-gold
pastel
peach-colored
periwinkle
petal-like
phosphorescent
pink-toned
porcelain
powdery
pumpkin-colored
quartz-pink
radiant
rain-washed
reddened
reflective-gray
rime-covered
rose-gold
ruddy
sable
sage
salmon
sandy-beige
sapphire
scarlet
shadowy-gray
shell-colored
shimmering
shiny-gray
silica-like
silver-gray
slate-blue
smoked
snow-dusted
soft-gray
solitary-hued
sparkling
speckled-gray
spiced
spinel-like
spun-gold
stained
stone-gray
stormy
sun-kissed
sunset-hued
tangerine
tawny
terracotta
tiger-colored
tinted
topaz
turquoise
umber-shaded
vanilla-colored
velvety
verdigris
veridian
vivid-red
waxen
whisper-gray
winter-pale
wooden-toned
zinc-gray
ashen-brown
ashen-blue
bare
basic-toned
blended
bold-colored
brassy
breezy
brittle
burnt-hue
calm-toned
carbon-like
carved
chalk-like
charred
chilled
cinereal
classic-toned
clean-hued
clear-toned
cold-shaded
color-shifted
compressed
concentrated
congealed
cool-toned
corroded
crackled
craggy
crisped
crumpled
crystal-like
darkening
dehydrated
dense-gray
desaturated
diffused
diluted
dimmed
dimpled
distilled
dithered
dormant
drained
drizzled
dry-gray
dusty-blue
dusty-brown
earthen-gray
echoing
elastic
elemental
etched
ever-dull
expanded-hue
faded-brown
featherlike
feeble
fibered
filmy
fissured
fissile
flecked
flexed
fog-like
fragmentary
fritted
frost-bitten
frozen
fumed
gauzy
gelled
ghost-gray
glassy
gleaming-gray
glittering
glowed
grainy-gray
granulated
grayed
green-tinted
grey-blue
half-lit
harmonized
hardened
hazed
heat-dulled
heated
heavy-toned
hoary
humid
icy-gray
ignited
imbued
imprinted
inlaid
ink-like
interlaced
intermixed
iron-gray
jaded
jellied
lacelike
lacquered
laminated
layered-gray
leached
leathern
lichen-colored
lightened
lignified
limpid
lofty-hued
lurid
lustrous
malleable
manganese-gray
marbled
matte-gray
melded
mellowed
mellow-toned
metal-gray
mist-hued
mixed-hue
monochrome
moon-gray
muffled
neutral
neutralized
nimble-toned
night-blue
night-gray
nonreflective
oaken
opal-hued
opaque-gray
oxidized
pale-beige
pale-blue
pale-brown
pale-lilac
pale-rose
pale-yellow
paperlike
pastel-gray
patterned-gray
pebbled
peeling
peppered
perforated
permeated
pigmented-gray
pilose
pitted
plated
plumbic
powder-gray
primeval
prismatic-gray
quiet-toned
quiescent
raw-toned
reddish-gray
refracted
resinous
rifted
rigid
ripened
rippled
ruddy-gray
rusted-gray
rustic
salted
sand-gray
sandy-toned
saturated
scarred
scorched
scraped
scratchy
seared
seashell-colored
shadow-grey
sheened
shrouded
silken
silvered
simmering
sintered
slender-toned
smelted
smokelike
smoothed
softened
solid-toned
sombre
sooted
spark-like
specklish
spongy
sprinkled
static-gray
stippled
stone-like
storm-blue
storm-dimmed
striated
striped
subtle-toned
sulfur-colored
sun-bleached
sun-tinged
tamed tone
tanned-gray
tarnished
tempest-blue
tempered
thermal-gray
thinned
toneless
tousled
transformed
transitioned
trimmed
turbid
twilit
twisted-hue
ultralight
ultradark
uncleaned
undercast
underlit
unglazed
unhued
uniform-gray
untreated
vapor-gray
varnished
veined
vibrant-blue
vibrant-yellow
viscous
washed-gray
waxlike
weathered
whitish-gray
wilted
wind-scoured
wood-gray
worn
zephyr-gray
ashen-red
ashen-green
aura-like
balanced-toned
banded
barely-tinted
beaming
billowed
bleak
blur-like
braided
brisk
buffered
caked
calcareous
calico-toned
caramelized
centric-hued
ceramic-like
cheesy
chiseled
chromatic
chunked
cloaked
clotted
cloudlike
coalesced
coated
cobbled
cohesive
collaged
colored-gray
compressed-hue
concrete-like
contoured
cool-hue
corrugated
creased
crested
crooked
crusted
crystal-toned
dappled-brown
dark-blue
dark-gold
dark-purple
daylit
decayed
deepened
deformed
desert-like
diffusing
dimple-like
dimmed-gray
dingy
dirt-gray
draped
dullened
dusky-blue
earth-like
echo-like
elastic-gray
embered
enamel-like
engraved
etched-gray
ethereal
evaporated
extended-hue
fabric-like
feathery
felt-like
ferric-gray
ferrous
fervent
filamented
fined
flat-gray
floral-toned
foamy
fog-silver
formed
fragile-toned
friable
frost-glass
frost-hue
frost-shade
fumed-gray
fused
gauze-gray
gel-like
gessoed
gilded-edge
gild-hued
glassy-gray
glaucous-gray
glimpsed
glinted
glistened
glitter-gray
glowed-gray
grain-blend
granular-gray
graphite-like
greened
gull-gray
halo-gray
hard-gray
harsh-gray
heat-warped
hollow-toned
humid-gray
ice-blue
ice-tinted
icy-brown
imbibed
imparted
imprecise
incised
ingrained
inked
inset
interfolded
iron-toned
irregular-toned
island-hued
ivory-gray
jade-gray
jewel-toned
kilned
laced
lacelike-gray
laminar
lamplit
latent
lava-toned
layerlike
leaflike
lichen-gray
light-grayish
limestone-gray
lineated
lit
loose-toned
lunar-gray
lush-toned
magma-toned
majestic-hued
maple-toned
marked
marred
marred-gray
mauve-gray
merging
metaled
metal-shine
mica-like
microtextured
mild-hued
mineral-like
mist-blue
mist-shaded
mist-softened
mixed-gray
molten-hue
moon-shaded
morphous
neutral-tone
abraded
absorptive
acidic-toned
acoustic-like
adobe-colored
aerated
agitated
airbrushed
alabaster
algal
aligned-gray
alkaline-toned
alluvial
amber-gray
amplified
angular
annealed
anodized
antique-toned
apatite-like
apricot-tinted
arctic-pale
argillaceous
arid-toned
ashen-tan
ashen-violet
asperous
atomized
auric
auroral
autumnal
auxiliary-hued
backlit
banded-gray
barium-like
basalt-like
bathed
beaded
beaming-gray
beeswax-like
benthic
bicolored
bilayered
birch-toned
bisected
bleary
blended-gray
blistered
blithe-hued
blocky
bloodless
bloom-like
blooming-gray
bloomy
blotted
blousy
blue-grayish
bluish-green
blurred-grayish
boiled-hue
bone-dry
borosilicate-like
bottled-tone
branched
brassy-gray
brecciated
breezy-gray
bridge-like
brightened
brimmed
brindled-gray
brittle-gray
broadened
bronze-gray
bubbled
buffered-gray
buggy-textured
bulbous
bullseye-like
bumpy
burgeoning
burnt-amber
burnt-beige
burnt-umber
buttered
calcic
calcified
caliginous
calloused
camo-toned
camphor-like
canary-hued
carbon-gray
carmelite
carved-gray
caseous
casted
cauterized
cedar-toned
celadon
cellular
ceramic-gray
cerated
cerulean-gray
chafed
chalk-beige
chalk-gray
chamois-colored
charcoal-blue
charred-gray
chartreuse-gray
chevroned
chilled-gray
chipped
chloritic
chromed
chromic-gray
cinereal-gray
cirrus-like
citrine-gray
clastic
clayey
clay-gray
clickish
climactic-hue
clipped
cloistral
cloud-bled
clover-toned
coal-dusted
coaly
cobweb-like
coherent-toned
coiled
cold-gray
colloidal
colorfast
color-lean
columnar
comb-like
compressed-gray
conchoidal
condensed
conductive
congealed-gray
coniferous-toned
conscripted-hue
consolidated
contaminated
contoured-gray
cool-gray-blue
copal-like
copper-gray
coralline
corky
corroded-gray
coruscant
cotyloid
cotyledon-like
couloured-edge
crazed
cream-tinted
creased-gray
crepuscular
crimped
crinkled
crisp-gray
crooked-gray
cross-grained
cruciform
crumpled-gray
crust-gray
cryptic-toned
crystalline-gray
culminated-hue
cumulus-like
cured-hue
curled
cuticular
cutstone-like
cyan-gray
cyanic
cyclonic-hue
damaged-gray
dapple-gray
darkened-tan
darkish
daylight-gray
deadened
decal-like
deep-gray
defocused
deformed-gray
degassed
degreened
deliquescent
demineralized
dense-blue
denuded
desert-toned
desiccated
detailed-gray
dew-like
diaphanous
diatom-like
diffused-gray
dilated
dimple-gray
dingy-blue
dirty-taupe
discolored
discrete-toned
disheveled
dissolved
distended
distorted-gray
dither-gray
divergent-hue
dovetailed
downcast
drab-gray
dragged-texture
dreamlike
drifted
drizzled-gray
droned
dry-brown
dulled
dulled-blue
duned
dusky-brown
dust-gray
dustlike
dwarf-toned
dyed-gray
earthed
eburnean
echo-gray
ectic
edged-gray
effaced
effervescent
eggshell-gray
elastic-toned
electrum
elevated
elliptical-toned
ember-gray
emerald-gray
emissive
enameled
encased
enchanted-hue
encrusted
engorged
engrained
enlivened
enriched-hue
enshrouded
entrenched
enveloped
ephemeral-gray
epidotic
etched-brown
etched-blue
ethereal-gray
even-toned
expanded-gray
extended-gray
extruded
fabric-gray
faceted
faded-blue
falling-toned
fallow
fanlike
fanned
farrowed
feathered-gray
feeble-gray
felt-gray
fermented
ferrous-gray
fervid
fiber-gray
fibrillar
fibrillated
fibrinous
filagree-like
filament-gray
film-like
filtered-gray
fine-grained
fired-gray
firm-gray
fissured-gray
flaked
flambe-like
flared
flat-brown
flatted
fledgling-toned
fleeting
flexuous
flinty
floored-hue
florid
flushed
fluxed
foamed
fog-gray
foghued
folded-gray
foliated
fractured-gray
fragile-gray
frangible
freckled-gray
french-gray
fretwork-like
frigid-gray
frost-gray
frost-veined
frozen-gray
fumed-blue
furrowed-gray
fusain-like
galactic-hued
galling
garden-toned
garish
gauzed
gelid
gemlike
gentrified-hue
geode-like
geometric-hued
gesso-gray
ghastly-gray
gilded-gray
gimleted
glacial
glassy-blue
gleamy
gleaned
glimmery
glistened-gray
gloaming-hue
globular-gray
gloom-gray
gloss-gray
glowed-blue
glowed-brown
glowered
glowing-blue
gnarled
gneiss-like
gold-gray
gossamer
grain-gray
granite-gray
granulated-gray
graphitic-blue
gravely
greened-gray
green-gray
greenish-black
grit-gray
grizzle-gray
grooved
grounded-hue
gummy
gypsum-like
halo-blue
halo-brown
hardened-gray
hazy-brown
heat-gray
heavy-gray
heather-gray
heathered
helium-like
hematitic
herbaceous-toned
high-lit
hoar
hollow-gray
honey-gray
horizon-hued
hued-gray
humid-blue
hushed-gray
hybrid-toned
hydric
igneous-like
illuminated
impasto-like
imbued-gray
immersed
imminent-hue
impact-gray
imperfect-toned
imprinted-gray
in-blend
incarnadine
inert-gray
infused
ingot-like
ink-washed
ink-stained
inlaid-gray
inner-lit
inscribed
interbedded
interlayered
interlocked
intermixed-gray
intertwined
intumescent
ionized
iridescent-gray
isolated-hue
ivory-toned
jade-like
jagged-gray
jasper-like
jeweled-gray
jolted
juvenile-hued
kalsedon-like
keened
kept-gray
kinetic-toned
knotty
lacelike-blue
lacelike-brown
lake-toned
laminated-gray
lamplit-gray
lapidary
lapsed-hue
layered-blue
leaf-gray
leather-gray
leavened
ledgy
lichen-like
lifted-gray
liminal
limonite
lined-gray
linear-toned
lingering-gray
liquid-gray
lissome-toned
listless
lithic
lithified
loamy
loft-gray
lone-gray
long-grained
looming
loosened
low-lit
luminant
lunar-brown
lush-gray
lustrous-gray
lyric-toned
maddened-hue
magnetic-gray
malted
manganic
manifold-hue
mantled
marbled-brown
marbled-blue
margined
maroon-gray
marten-like
massive-gray
matte-brown
matte-blue
mealy
mellow-gray
melting-toned
membranous
mended
mercurial
merled
mica-gray
mild-gray
milky-gray
mineral-gray
minimized-hue
mirrored-gray
mist-brown
mist-laced
mist-paled
mixed-brown
mixed-blue
modulated-hue
molten-brown
monolithic
moon-tinted
moss-gray
mottled-brown
mottled-blue
muffled-gray
muscovite-like
muted-brown
muted-blue
mylar-like
mythic-hue
nacreous
nascent-hue
nebular
nebulous-gray
neon-like
neutral-gray
new-slate
nimbic
nipped
noctilucent
nonmetallic
notched-gray
nubbed
nubile-toned
nubby
obsidian-gray
ochre-gray
oily-gray
opal-gray
opal-tinted
opaque-brown
optimized-hue
orbital-toned
orelike
outlined
oxidic
oxide-gray
oxygenated
pale-green
pale-umber
pale-violet
pale-coral
pale-mint
pale-ivory
pallid-gray
paper-gray
parchment-like
patched
pearl-gray
pebbled-gray
peeling-gray
pelagic
pendulous
pepper-gray
permeated-gray
permineralized
peroxide-toned
phosphor-gray
photic
pitted-gray
planed
plasma-hued
plate-like
platinum-gray
platy
pleated
pliable
plucked
plum-gray
plush
pooled-gray
porous-gray
portland-gray
powder-blue
powder-beige
powder-brown
precipitated
pressed
prickled
primary-gray
processed
prolonged-hue
pronged
pyritic
pyroclastic
quartz-gray
quartz-like
quickened
quiet-gray
quilted
rain-worn
raked
rayed
ream-like
recast-hue
reddened-gray
reeded
refined-gray
refracted-gray
reframed
regolith-like
reinforced
relief-gray
residual-gray
reticulated
rheumy
ridge-gray
rift-gray
rigid-gray
rilled
rippling-gray
riven
rocklike
rolled-gray
rootlike
roughened-gray
rubbed-gray
rudaceous
ruffled
rutilated
sable-gray
sacrificed-hue
salt-gray
sand-blend
sand-blue
sand-brown
sanded
sap-green
sapphire-gray
saturated-gray
scarlet-gray
scattered-gray
scented-hue
scoria-like
scratch-gray
scribbled
scuffed
sculpted
scumbled
seamed
sear-gray
sedate-toned
selenite-like
sepulchral
sericite-like
shadow-blue
shadow-brown
shale-like
shared-gray
shattered
shear-toned
shingled
shiny-brown
shiny-blue
shivered
shrunken
siltlike
silky-gray
silver-blue
silver-brown
sinter-gray
siphoned
sketched
skimmed
skylike
slab-gray
slaked
slanted
slate-brown
slender-gray
slivered
sloughing
smalt-toned
smelt-gray
smoky-brown
smoky-blue
smoothed-gray
snapped
snow-blue
snow-brown
soaked-gray
sodden
soft-brown
soft-blue
soled
soot-gray
sorrel-toned
spark-gray
sparse-gray
spearmint-toned
specular
spent-gray
spiny
spiraled
splashed
split-toned
splintered
spoked
spongy-gray
spooled
sprayed
sprigged
spun-gray
squamous
stacked
stained-blue
stalklike
star-gray
stark-gray
steam-gray
steel-brown
stellar-toned
stipple-gray
stoked
stone-brown
stone-blue
storm-gray
strained-gray
stratified
streamed
stressed
striated-gray
striped-blue
striped-brown
studded
stunted
sturdy-gray
subdued-gray
sublimed
subsurface-gray
sulfur-gray
sun-gray
sunkissed-gray
sunlit-gray
supercooled
surfaced
swirled-gray
synclinal
tabular
talc-like
talc-gray
tanned-brown
tanned-blue
tarnished-gray
taupe-gray
teal-gray
tempered-gray
tenuous
terraced
thermal-blue
thermal-brown
thinned-gray
thready
tiger-gray
tiled
tinctured
tinted-brown
tinted-blue
toned-gray
toppled
torqued
translucid
transmuted
traveled-hue
tremored
trenched
triadic-hue
trilled
tumbled
turbulent-gray
twisted-gray
ultrafine
ultrathin
umbrous
undercast-gray
underlit-gray
undulant
uneven-gray
unfrosted
unglazed-gray
unpolished
unrough
untanned
untouched
uranic
vague-gray
varicolored
veiled-gray
velvet-gray
verdant-gray
verge-gray
vermicular
vernal-toned
vibrant-gray
vined
vintage-gray
viscid
voiced-hue
vortexed
vulcan-like
wan-gray
washed-blue
washed-brown
wasted-hue
weather-gray
webbed
whalebone-colored
wheat-gray
whetted
whorled
wicked-hue
wind-gray
wind-paled
wintered
wiped
wood-brown
wood-blue
wool-gray
worn-gray
wrought-gray
xenic-hue
xero-toned
xerothermic
yeasted
yellow-gray
young-toned
zephyrous
zinc-like
zircon-like
zoned-gray
abloom
abrasive
absorbent
acicular
acoustic-toned
adherent
adhesive
adumbral
aeriform
aetheric
aggregate
aglow
alabastrine
albescent
alkalic
alluring
almondine
alveolated
amberine
amethystine
amorphic
amphorous
ancestral-toned
angulated
anisotropic
antlered
apical
aplite-like
arborescent
arced
argent
argentine
arid-gray
ashen-gold
ashy-blue
asperitic
asphaltic
aster-like
astral-toned
atrophic
aurated
autogenous
autumn-hued
avalanching
azure-tinted
baffled
baked-gray
balanced-gray
bandlike
bandwise
barium-toned
basined
basinlike
basion-like
beaded-gray
beamy
bedded
beeswax-gray
bejewelled
belayed-hue
bellied
belted
bent-gray
berried
berry-toned
beveled
biased-gray
bicolorous
bifacial
bifurcate
billet-toned
billowing
bimodal-hued
biotite-like
birch-gray
bladed
blanched-gray
blare-like
blasted
blaze-tinted
blear
blear-gray
blemished
blended-brown
blinding
blister-gray
blithe
block-blue
blocked
blond-toned
blotched-gray
blousy-gray
blown-gray
blown-out
bluish-tan
blunt-gray
blur-washed
boiled-gray
bony-gray
boron-like
bossed
bounded
bowed
branched-gray
brash
brazed
breached
breathy
breech-like
briar-like
brimmed-gray
briny
bristled
brittled
brocaded
bronze-brown
bronze-hint
bronze-tint
brooding
broomlike
brown-cast
brown-paled
brushy
brumal
brunet-toned
buckled
bulging-gray
bulked
bullate
bundled
burled
burned-gray
burnt-lilac
burr-like
busied
bushy-gray
butter-gray
buzzworthy
byte-toned
cabled
calcic-gray
calcined
caledonian-hued
caliginous-gray
callow-hued
cambered
camellia-toned
candescent
canopied
canted
capillary-like
caprine-toned
caramel-gray
carbon-toned
careened
carinate
carious
carmine-gray
carob-toned
carroty
carved-blue
castellated
cattail-like
celery-toned
cellular-gray
cement-gray
cerise
chaffy
chaotic-hued
chapleted
char-gray
charlock-toned
chartreuse-toned
chased
checker-gray
cheesy-gray
chevron-gray
chill-gray
chinoidal
chirred
chlorotic
chromal
chromatic-gray
chromite-like
chthonic-toned
cicatricial
cimolite-like
cinereous
circled
circuited
citrine-toned
cladded
clayey-gray
cleaved
cliff-gray
clipped-gray
cloddy
cloud-gray-brown
cloud-gray-blue
clubbed
cluster-gray
coated-gray
cobalt-like
cobwebbed
cogged
coherent-gray
coiled-gray
collared
colonnaded
color-bled
color-dimmed
color-drawn
color-hazed
column-gray
comb-gray
compact-gray
composed-gray
concave-gray
concolorous
condensed-gray
conductive-gray
confined-hue
confluent
conformed
confronted-hue
congested
conic
conoid
consolidated-gray
constricted
contoured-blue
contoured-brown
contrasted
convected
convex-gray
convictive
cool-grayish
cool-umber
coppiced
copse-like
coral-gray
corded
cordial-toned
cornflower-tinted
coronal-toned
coronated-hue
corraded
corrigated
corroded-blue
corrugated-gray
coruscating
cotton-like
crackled-gray
crag-brown
crag-blue
cranial-hued
creased-blue
created-gray
crepuscule-hued
crescive
crested-gray
cribbed
crimp-gray
crisp-brown
crisp-blue
crispened
cristate
crooked-blue
crumpled-blue
crusted-blue
cryophilic
crypto-toned
crystalline-blue
ctenate
cuddled-toned
cumuliform
cumulose
cupreous
curdled
current-like
curtained
cut-grain
cyanic-gray
cymose
damped
damped-gray
dapple-brown
darkened-blue
darkened-grayish
dark-rose
darted
datolite-like
day-warmed
dead-leaf-toned
debased-hue
decal-gray
deepened-blue
deepened-brown
defocused-gray
degenerate-hue
deglazed
dehiscent
delaminated
deliquesced
dented
deplated
depressed-gray
dermal-like
descaled
desert-gray
desert-paled
designed-gray
detached-gray
dethinned
detoned
deveined
devitrified
dew-gray
diadem-like
dialated
diatomaceous
dihedral
dimple-brown
dimple-blue
dinned
dinose
dirt-blue
disbonded
discolored-blue
discordant-hue
discrete-gray
dished
dispensed-hue
dissolved-gray
distal-toned
distributed-gray
ditchlike
divaricate
divergent-gray
divided-gray
dock-gray
dodecagonal
dolomitic
dolphin-gray
domed-gray
dormant-blue
dormant-brown
dotted-gray
dowdy
draggy
drained-gray
draped-gray
drawable
drawn-gray
drift-gray
drill-patterned
dripped-gray
droning
drossy
dry-blue
dry-lilac
dulled-grayish
dulled-lilac
dune-gray
dune-like
duplex-toned
dusky-lilac
dustlike-gray
dust-paled
ebb-gray
ebonized
ecbolic
echinoid
ectopic-hued
edged-blue
edged-brown
edgy-gray
efferent
efflorescent
effused
eggshell-toned
elastic-blue
elastic-brown
elastoid
elective-gray
electro-toned
ellipsoidal
ember-tinted
emerald-toned
emplaced
enamel-gray
encrusted-gray
engraved-gray
enhanced-gray
enrooted
enstatitic
ensweeted
entangled
enticed-hue
entrenched-gray
enucleated
enveloped-gray
epiphanic-hue
epoxy-like
etched-grayish
etiolated
evaporative
eventoned
ever-hazed
ever-paled
evincing
excess-gray
exfoliated
expanded-blue
expanded-brown
expanded-hue
expansile
extrafine
facial-hued
faceted-blue
faceted-brown
factured
fallow-gray
fanned-gray
farrow-gray
felted
fendered
ferric-blue
ferric-brown
ferruginous
fibroid
fibered-gray
fictive
fillagree
film-gray
filter-gray
finely-toned
finned
fire-dulled
fire-worn
fired-brown
fired-blue
firmament-hued
fissured-blue
fissured-brown
